Revit API Introduction Labs
Lab3_6_DuplicateWallType Class
 Create a new family symbol or type by calling Duplicate() on an existing one and then modifying its parameters.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab3_6_DuplicateWallType : IExternalCommand
Visual Basic (Declaration)
Public Class Lab3_6_DuplicateWallType _
	Implements IExternalCommand
Visual C++
public ref class Lab3_6_DuplicateWallType : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab3_6_DuplicateWallType
See Also
Lab3_6_DuplicateWallType Members
Labs Namespace